
const dataArr = ["7572337334", "2737301", "7609684655", "2737301", "7572337350", "2737302", "7571768836", "2737302", "7572337480", "2737303", "7571769086", "2737304", "7572337510", "2737304", "7572337523", "2737304", "7571769103", "2737305", "7572337406", "2737305", "7571769129", "2737306", "7571749491", "2737603", "7572605464", "2737603", "7572584004", "2737603", "7572584017", "2737603", "7572584033", "2737603", "7572584046", "2737603", "7571749505", "2737604", "7572605493", "2737604", "7572605480", "2737604", "7572584059", "2737604", "7572605507", "2737604", "7585618750", "2737605", "7571749420", "2737401", "7572604836", "2737401", "7572583388", "2737401", "7572604810", "2737401", "7571749433", "2737402", "7572583391", "2737402", "7572583405", "2737402", "7572583418", "2737402", "7572583450", "2737403", "7571749446", "27374-03", "7572604982", "2737403", "7571749459", "2737501", "7572583724", "27375-01", "7572583737", "2737501", "7572583753", "2737501", "7571749462", "2737502", "7572583782", "2737502", "7572605288", "2737502", "7572605291", "2737502", "7571749475", "2737601", "7572583939", "2737601", "7572605389", "2737601", "7572583955", "2737601", "7571749488", "2737602", "7572583968", "2737602", "7572583971", "2737602", "7572605451", "2737602", "7571763772", "2737101", "7609580214", "2737101", "7597813929", "27371-01", "7572337086", "2737203", "7571768735", "2737204", "7571769145", "2738101", "7572338425", "2738101", "7609684671", "2738101", "7572361704", "2738102", "7572338483", "2738102", "7571769158", "2738102", "7572338584", "2738102", "7571769204", "2738104", "7572338627", "2738104", "7571769217", "2738105", "7571769233", "2738106", "7572361775", "2738106", "7572338685", "2738106", "7571769262", "2738201", "7609684727", "2738201", "7571771302", "2738203", "7571771373", "2738205", "7572340318", "2738206", "7572361919", "2738301", "7609686039", "2738301", "7572340376", "2738302", "7572361892", "2738304", "7572340507", "2738305", "7571771618", "2738305", "7572361964", "2738306", "7572587410", "2739501", "7572613036", "2740303", "7572588758", "2740403", "7571749417", "2740403", "7572588761", "2740403", "7609599850", "2741101", "7601359490", "2741201", "7609580520", "2741201", "7609599889", "2741301", "7572588224", "2741401", "7572588266", "2741401", "7609598020", "2741401", "7572612655", "2741403", "7572588455", "2741403", "7572588468", "2741403", "7572588341", "2741501", "7571749143", "2741504", "7572612743", "2741504", "7572588514", "2741504", "7572612596", "2741502", "7572588400", "2741502", "7572588413", "2741502", "7601360537", "2742101", "7609580533", "2742101", "7609580546", "2742201", "7609580559", "2742301", "7572588891", "2742503", "7572613124", "2742503", "7609597346", "2742503", "7572588833", "2742501", "7572588875", "2742502", "7571749169", "2742402", "7572588787", "2742402", "7609580591", "2742402"];


for (let i = 0; i < dataArr.length / 2; i++) {
    let sericalNo = dataArr[i * 2];
    let boxerNum = dataArr[i * 2 + 1];
    let intervalTime = Math.ceil(Math.random() * 10) * 2000 + 5000;


    sleep(5000);
    text("新增").click();


    sleep(3000);
    text("户号 ").click();
    sleep(3000);
    className("android.widget.EditText").depth(16).findOne().setText(sericalNo);
    sleep(7000);
    className("android.widget.Button").depth(14).indexInParent(1).findOne().click();
    sleep(3000);
    text("立即查询").click();
    sleep(8000);
    text("生成普查工单").click();
    sleep(2000);
    text("确定").click();
    sleep(14000);
    if (text("生成普查工单").exists()) {
        console.show();
        console.log("服务器反映异常或者存在普查工单重复提交现象，请重启APP!");
        sleep(4000);
        exit();
    };




    sleep(5000);
    className("android.view.View").depth(17).findOne().click();
    console.log("className(android.view.View).depth(17).findOne().click()")

    sleep(5000);
    text("保存").click();


    sleep(5000);
    while (!text("定位").boundsInside(0, 0, device.width, device.height / 5 * 4).exists()) {
        swipe(450, 1600, 450, 500, 500);
        sleep(2000);
    };
    sleep(2000);
    text("定位").click();
    sleep(5000);
    text("保存").click();

    sleep(2000);
    text("电源").click();
    sleep(2000);
    text("供电电源信息").click();
    while (!className("android.widget.Button").depth(26).indexInParent(4).boundsInside(0, 0, device.width, device.height / 4 * 3).exists()) {
        swipe(450, 1000, 450, 500, 500);
        sleep(2000);
    };
    sleep(2000);
    className("android.widget.Button").depth(26).indexInParent(4).findOne().click();
    sleep(2000);
    className("android.widget.EditText").depth(13).indexInParent(0).findOne().setText(boxerNum);
    sleep(2000);
    text("确定").click();
    sleep(2000);
    className("android.widget.Button").depth(26).indexInParent(7).findOne().click();
    console.log(device.width, device.height);
    sleep(2000);
    while (!className("android.widget.Button").depth(11).indexInParent(21).boundsInside(0, 0, device.width, device.height / 20 * 19).exists()) {
        swipe(450, 1200, 450, 500, 500);
        sleep(2000);
    };
    sleep(2000);
    className("android.widget.Button").depth(11).indexInParent(21).click();
    while (!className("android.widget.Button").depth(26).indexInParent(9).boundsInside(0, 0, device.width, device.height / 4 * 3).exists()) {
        swipe(450, 1000, 450, 500, 500);
        sleep(2000);
    };
    className("android.widget.Button").depth(26).indexInParent(9).findOne().click();
    sleep(2000)
    text("低压客户开关保护(客户侧)").click();
    sleep(2000)
    className("android.widget.Button").depth(26).indexInParent(10).findOne().click();
    sleep(2000)
    text("其他").click();
    sleep(2000);
    text("保存").click();

    sleep(5000);
    text("提交").click();
    sleep(Math.ceil(intervalTime / 2));
    do {
        text("提交").click();
        sleep(Math.ceil(intervalTime / 2));
    } while (text("提交").exists());

    sleep(Math.ceil(intervalTime / 2));
    console.log(intervalTime, text("提交").exists(), sericalNo);

}
console.log("完成！");
